#!/bin/bash

#!/bin/bash

# color
CYAN='\033[0;36m'
RED='\033[0;31m'
GREEN='\033[0;32m'
BLUE='\033[0;34m'
RESET='\033[0m'

echo -e ""
echo -e '\033[0;32m'
echo -e ' █████╗ ██╗      ██████╗██╗  ██╗███████╗███╗   ███╗██╗   ██╗███████╗██╗███╗   ██╗ █████╗ ███╗   ██╗ ██████╗███████╗'
echo -e '██╔══██╗██║     ██╔════╝██║  ██║██╔════╝████╗ ████║╚██╗ ██╔╝██╔════╝██║████╗  ██║██╔══██╗████╗  ██║██╔════╝██╔════╝'
echo -e '███████║██║     ██║     ███████║█████╗  ██╔████╔██║ ╚████╔╝ █████╗  ██║██╔██╗ ██║███████║██╔██╗ ██║██║     █████╗  '
echo -e '██╔══██║██║     ██║     ██╔══██║██╔══╝  ██║╚██╔╝██║  ╚██╔╝  ██╔══╝  ██║██║╚██╗██║██╔══██║██║╚██╗██║██║     ██╔══╝  '
echo -e '██║  ██║███████╗╚██████╗██║  ██║███████╗██║ ╚═╝ ██║   ██║   ██║     ██║██║ ╚████║██║  ██║██║ ╚████║╚██████╗███████╗'
echo -e '╚═╝  ╚═╝╚══════╝ ╚═════╝╚═╝  ╚═╝╚══════╝╚═╝     ╚═╝   ╚═╝   ╚═╝     ╚═╝╚═╝  ╚═══╝╚═╝  ╚═╝╚═╝  ╚═══╝ ╚═════╝╚══════╝'
echo -e '\033[0m'
echo -e ""
echo -e "${GREEN}油管频道:${RESET} ${CYAN}https://www.youtube.com/@alchemyfinance/"${RESET};
echo -e "${GREEN}法师社群:${RESET} ${CYAN}https://t.me/ytalchemy/"${RESET};
echo ""

# 创建一个新的屏幕会话
echo -e "\n📟 恢复pipe状态"
    cd ~/pipe-node
    while true; do
        echo '📊 节点状态:'
        ./pop --status
        echo ''
        echo '🏆 检查积分:'
        ./pop --points
        echo ''
        echo '⏰ 检查活动时间:'
        ./pop --stats
        echo '🔄 每10秒更新一次...'
        sleep 10
    done
